---
kind: method
id: M:Autodesk.Revit.DB.IFC.RoofComponents.Dispose
source: html/0988e875-cea9-289c-fada-eccd98613e32.htm
---
# Autodesk.Revit.DB.IFC.RoofComponents.Dispose Method

Releases all resources used by the RoofComponents

## Syntax (C#)
```csharp
public void Dispose()
```